In [1]:
import pandas as pd
import numpy as np

In [12]:
a={"name":["ayush","achman","achman1","achman2"], "age":[19,18,22,34], "weight":[29,28,34,44]}
ser=pd.Series(a)
ser
df=pd.DataFrame(a)
# print(df)
df

      name  age  weight
0    ayush   19      29
1   achman   18      28
2  achman1   22      34
3  achman2   34      44

In [16]:
slicced_df=df.loc[0:2,['weight']]
slicced_df

   weight
0      29
1      28
2      34

In [20]:
ind=df.at[0,'name']
ind1=df.at[2,'name']
print(ind)
print(ind1)

ayush
achman1

In [30]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df1=pd.DataFrame(exam_data)
print(df1[['name','score','attempts']])

        name  score  attempts
0  Anastasia   12.5         1
1       Dima    9.0         3
2  Katherine   16.5         2
3      James    NaN         3
4      Emily    9.0         2
5    Michael   20.0         3
6    Matthew   14.5         1
7      Laura    NaN         1
8      Kevin    8.0         2
9      Jonas   19.0         1